In [1]:
import pandas as pd

# Charger le fichier CSV des clients
data_clients = pd.read_csv("clients_ventes.csv")
data_clients.head()

   Client_ID    Nom   Age  Achat      Ville
0          1  Alice  25.0  150.0      Paris
1          2    Bob   NaN  200.0       Lyon
2          3    NaN  30.0  300.0  Marseille
3          4  David  22.0    NaN      Lille
4          5    Eve  29.0  500.0        NaN

In [2]:
data_clients.info()
data_clients.isnull().sum()  # Compter les valeurs manquantes par colonne

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Client_ID  5 non-null      int64
 1   Nom        4 non-null      object
 2   Age        4 non-null      float64
 3   Achat      4 non-null      float64
 4   Ville      4 non-null      object
dtypes: float64(2), int64(1), object(2)
memory usage: 328.0+ bytes

Client_ID    0
Nom          1
Age          1
Achat        1
Ville        1
dtype: int64

In [3]:
data_clients['Age'].fillna(data_clients['Age'].mean(), inplace=True)
data_clients['Achat'].fillna(data_clients['Achat'].mean(), inplace=True)

In [4]:
data_clients['Ville'].fillna("Inconnue", inplace=True)

In [5]:
data_clients.isnull().sum()  # Vérifier s'il reste des valeurs manquantes
data_clients.head()  # Afficher les premières lignes pour vérifier

   Client_ID    Nom   Age  Achat      Ville
0          1  Alice  25.0  150.0      Paris
1          2    Bob  26.5  200.0       Lyon
2          3    NaN  30.0  300.0  Marseille
3          4  David  22.0  287.5      Lille
4          5    Eve  29.0  500.0   Inconnue